Select [Код_книги], count(*) from [dbo].[Абонемент/Е3]
group by [Код_книги]




Select [Код_книги], count(*) from [dbo].[Штраф/E5]
where [Книга_утеряна]=1
group by [Код_книги]

select sum(Количество_книг) from [Книга/E2] 

select Название from [Книга/E2] where Название not in (null)

select Фамилия, Имя, Название, Издательство
from [Штраф/E5] inner join [Абонемент/Е3] on [Штраф/E5].Дата_выдачи = [Абонемент/Е3].Дата_выдачи and 
[Штраф/E5].Код_книги = [Абонемент/Е3].Код_книги and [Штраф/E5].Код_читателя = [Абонемент/Е3].Код_читателя
inner join [Книга/E2] on [Книга/E2].Код_книги = [Абонемент/Е3].Код_книги 
inner join [Автор/E1] on [Книга/E2].Код_автора = [Автор/E1].Код_автора 
where Книга_утеряна = 1 and (select count(*) from [Штраф/E5] where Книга_утеряна = 1)
/ (cast((select count(*) from [Книга/E2]) as float)) > 0.25

select Фамилия, Имя, Название, Издательство
from [Книга/E2] inner join [Автор/E1] on [Книга/E2].Код_автора = [Автор/E1].Код_автора
				inner join (
		select Код_книги, count(*) as Утерянные
		from [Штраф/E5]
		where Книга_утеряна = 1
		group by Код_книги
		) as help on [Книга/E2].Код_книги = help.Код_книги
where (Утерянные / 1.0 / Количество_книг) > 0.25