select Фамилия, Имя, Название, Издательство
from [Штраф/E5] inner join [Абонемент/Е3] on [Штраф/E5].Дата_выдачи = [Абонемент/Е3].Дата_выдачи and 
[Штраф/E5].Код_книги = [Абонемент/Е3].Код_книги and [Штраф/E5].Код_читателя = [Абонемент/Е3].Код_читателя
inner join [Книга/E2] on [Книга/E2].Код_книги = [Абонемент/Е3].Код_книги 
inner join [Автор/E1] on [Книга/E2].Код_автора = [Автор/E1].Код_автора 
where Книга_утеряна = 1 and (select count(*) from [Штраф/E5] where Книга_утеряна = 1)
/ (cast((select count(*) from [Книга/E2]) as float)) > 0.25

select Название
from [Штраф/E5] inner join [Абонемент/Е3] on [Штраф/E5].Дата_выдачи = [Абонемент/Е3].Дата_выдачи and 
[Штраф/E5].Код_книги = [Абонемент/Е3].Код_книги and [Штраф/E5].Код_читателя = [Абонемент/Е3].Код_читателя
inner join [Книга/E2] on [Книга/E2].Код_книги = [Абонемент/Е3].Код_книги 
inner join [Автор/E1] on [Книга/E2].Код_автора = [Автор/E1].Код_автора 
where Книга_утеряна = 1 and (select count(*) from [Штраф/E5] where Книга_утеряна = 1)
/ (cast((select Количество_книг from [Книга/E2] where Код_книги = ) as float)) > 0.25

select Фамилия, Имя, Название, Издательство
from (
select Код_книги, count(*) as Утерянные from [Штраф/E5]
where Книга_утеряна = 1 group by Код_книги
) as help 
inner join [Книга/E2] on help.Код_книги = [Книга/E2].Код_книги 
inner join [Автор/E1] on [Книга/E2].Код_автора = [Автор/E1].Код_автора
where help.Утерянные / 1.0 / Количество_книг > 0.25 and Название not in ('Вторая')

update [Книга/E2] 
set Количество_книг = Количество_книг + 1
where Название in ('Третья','Девятая')

select Название, count(*) as Популярность
from [Абонемент/Е3] inner join [Книга/E2] on [Абонемент/Е3].Код_книги = [Книга/E2].Код_книги
group by Название, [Книга/E2].Код_книги
having count(*) >= (select min (help.Колво)
				    from (select top 5 Код_книги, count(*) as Колво
					   	  from [Абонемент/Е3]
						  group by Код_книги
						  order by Колво desc) as help)
order by Популярность desc