select Фамилия, Имя, Название, Издательство 
from [Автор/E1] inner join [Книга/E2] on [Автор/E1].Код_автора = [Книга/E2].Код_автора 
where Название like 'Третья' except (select Фамилия, Имя, Название, Издательство
from [Штраф/E5] inner join [Абонемент/Е3] on [Штраф/E5].Дата_выдачи = [Абонемент/Е3].Дата_выдачи and 
[Штраф/E5].Код_книги = [Абонемент/Е3].Код_книги and [Штраф/E5].Код_читателя = [Абонемент/Е3].Код_читателя
inner join [Книга/E2] on [Книга/E2].Код_книги = [Абонемент/Е3].Код_книги 
inner join [Автор/E1] on [Книга/E2].Код_автора = [Автор/E1].Код_автора 
where Книга_утеряна = 1 and (select count(*) from [Штраф/E5] where Книга_утеряна = 1)
/ (cast((select count(*) from [Книга/E2]) as float)) > 0.25)

---

select Фамилия, Имя, Название, Издательство
from [Штраф/E5] inner join [Абонемент/Е3] on [Штраф/E5].Дата_выдачи = [Абонемент/Е3].Дата_выдачи and 
[Штраф/E5].Код_книги = [Абонемент/Е3].Код_книги and [Штраф/E5].Код_читателя = [Абонемент/Е3].Код_читателя
inner join [Книга/E2] on [Книга/E2].Код_книги = [Абонемент/Е3].Код_книги 
inner join [Автор/E1] on [Книга/E2].Код_автора = [Автор/E1].Код_автора 
where Книга_утеряна = 1 and (select count(*) from [Штраф/E5] where Книга_утеряна = 1)
/ (cast((select count(*) from [Книга/E2]) as float)) > 0.25

---

select (select count(*) from [Штраф/E5] where Книга_утеряна = 1)
/ (cast((select count(*) from [Книга/E2]) as float)) 